# Day3
## pandas

In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
print("19")

19

In [6]:
arr = np.arange(1,10)
arr

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [8]:
s = pd.Series(arr)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [9]:
s = pd.Series(arr, dtype='int32')
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [10]:
s = pd.Series(['부장', '차장', '대리', '사원', '인턴'])
s

0    부장
1    차장
2    대리
3    사원
4    인턴
dtype: object

In [11]:
s

0    부장
1    차장
2    대리
3    사원
4    인턴
dtype: object

In [12]:
s[0]

'부장'

In [13]:
s = pd.Series(['마케팅', '경영', '개발', '기획', '인사'], index=['a', 'b', 'c', 'd', 'e'])
s

a    마케팅
b     경영
c     개발
d     기획
e     인사
dtype: object

In [14]:
s.shape #차원을 알수 있다. 지금은 1차원이다. 4차원 (1,2,3,4) 등등

(5,)

# NaN (Not a Number) (결측치)

Pandas에서 NaN 값은 비어있는 **결측치 데이터**를 의미합니다.

임의로 비어있는 값을 대입하고자 할 때는 **numpy의 nan (np.nan)**을 입력합니다.

In [18]:
arr = np.arange(50,55)
s1 = pd.Series(arr)
s1

0    50
1    51
2    52
3    53
4    54
dtype: int64

In [21]:
s1 = pd.Series(range(50,55),dtype='float32')
s1

0    50.0
1    51.0
2    52.0
3    53.0
4    54.0
dtype: float32

In [25]:
s2= pd.Series(['애플','삼성','노키아'], index = ['가','나','다'])
s2

가     애플
나     삼성
다    노키아
dtype: object

In [26]:
s2[1]

'삼성'

In [28]:
s2['가']

'애플'

In [30]:
s3 = pd.Series(['손흥민', '김연아', '박세리', '박찬호', '김연경'], index=['a', 'b', 'c', 'd', 'e'])
s3

a    손흥민
b    김연아
c    박세리
d    박찬호
e    김연경
dtype: object

In [31]:
s[0]

'손흥민'

In [32]:
s[-5]

'손흥민'

In [33]:
s['a']

'손흥민'

# fancy indexing

fancy indexing은 index를 선택하여 list로 정의하고, 선택한 index list로 indexing 하는 방법입니다.

In [36]:
s3=[['a','c']]
s3

[['a', 'c']]

In [37]:
s3

[['a', 'c']]

In [39]:
i = ['a','b']
i

['a', 'b']

In [42]:
s = pd.Series([29,39,49,59,69], index = ['a','b','c','d','e'])
                                    
s

a    29
b    39
c    49
d    59
e    69
dtype: int64

In [43]:
s >50

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [45]:
s6 = pd.Series(range(1,5))
s6

0    1
1    2
2    3
3    4
dtype: int64

In [46]:
s6>2

0    False
1    False
2     True
3     True
dtype: bool

In [ ]:
#슬라이싱에서 
숫자는 끝을 미포함
문자는 끝을 포함

In [47]:
s = pd.Series([29, 99, np.nan, 11, 56], index=['a', 'b', 'c', 'd', 'e'])
s

a    29.0
b    99.0
c     NaN
d    11.0
e    56.0
dtype: float64

In [48]:
s[1:3]

b    99.0
c     NaN
dtype: float64

In [49]:
s['a':'c']

a    29.0
b    99.0
c     NaN
dtype: float64

In [50]:
pd.DataFrame([[1, 2, 3], 
              [4, 5, 6], 
              [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [51]:
data = {
    'name': ['Kim', 'Lee', 'Park'], 
    'age': [24, 27, 34], 
    'children': [2, 1, 3]
}

df = pd.DataFrame(data)
df

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [52]:
df['name']

0     Kim
1     Lee
2    Park
Name: name, dtype: object

In [53]:
type(df['name']) #시리즈이다.

pandas.core.series.Series

In [54]:
df[['name', 'children']]

   name  children
0   Kim         2
1   Lee         1
2  Park         3

In [55]:
type(df[['name', 'children']])#데이터 프레임이다.

pandas.core.frame.DataFrame

In [56]:
df[0:1]

  name  age  children
0  Kim   24         2

In [57]:
type(df[0:1]) #슬라이싱 했는데 데이터 프레임으로 나온다;;

pandas.core.frame.DataFrame

In [58]:
df

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [61]:
df.rename(columns={'name':'이름'})

     이름  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [69]:

data=({
    'food' : ['kfc','mcdonald','school food'],
    'price' : [1000,2000,2500],
    'rating' : [4.5,3.9,4.2]
})


df= pd.DataFrame(data)
df

          food  price  rating
0          kfc   1000     4.5
1     mcdonald   2000     3.9
2  school food   2500     4.2

In [70]:
df[['food','rating']]

          food  rating
0          kfc     4.5
1     mcdonald     3.9
2  school food     4.2

In [73]:
df.columns = ['place','price','rating']
df

         place  price  rating
0          kfc   1000     4.5
1     mcdonald   2000     3.9
2  school food   2500     4.2

In [72]:
# 코드를 입력해 주세요

# 1) columns 속성 이용 > 전체
df.columns = ['place', 'price', 'rating']
df

# 2) rename 함수 이용 > 일부
df = df.rename(columns={'food':'place'}) # 재대입을 통해 원본에 적용 (반환 O)
df.rename(columns={'food':'place'}, inplace=True) # inplce를 사용해 원본에 적용 (반환 X, 재대입 X)
df

         place  price  rating
0          kfc   1000     4.5
1     mcdonald   2000     3.9
2  school food   2500     4.2

In [75]:
data = ({
    'a' : [111,222,333],
    'b' : [111,222,333],
    'c' : [111,222,333]
})

df= pd.DataFrame(data)
df

     a    b    c
0  111  111  111
1  222  222  222
2  333  333  333

In [85]:
# df.columns = ['place', 'price', 'rating']
# df

In [87]:
df.columns = ['d','e','f']
df

     d    e    f
0  111  111  111
1  222  222  222
2  333  333  333

In [99]:
df= df.rename(columns={'ddd':'ccc'})
df

   ccc    e    f
0  111  111  111
1  222  222  222
2  333  333  333

In [100]:
df.rename(columns={'ccc':'aaa'})

   aaa    e    f
0  111  111  111
1  222  222  222
2  333  333  333

데이터 프레임 만들고 연습해 봐야겠다.
이걸 봐서는 확실한것은 두가지이다.

1. 처음에 데이터 프레임을 만들때 df = 안에서 처음에 pd.datafeme 으로 판다쓰를 쓴다음에는 pd는 개입하지 않는다.
2. 이후 데이터의 전처리는 전적으로 df의 영역이며 df자체를 전처리 하려면 df.____ 
3. rename의 경우는 컬럼 자체의 딕셔너리를 조정해야 해서 df = 하는 이유가 뭘까??

# 엑셀 접근!!! 드디어!!

 1. 시트를 전부 부르고 싶다면 sheet_name=none (하지만 시트 네임을 행으로 가지고 나온다.)

In [ ]:
excel = pd.read_excel('data/seoul_transportation.xlsx', sheet_name='철도', engine='openpyxl')

In [ ]:
import os
print(os.getcwd())
# 경로를 가져올수 있다. (현재 이게 활성화 되어 있는)

In [ ]:
# # df = pd.read_excel('data/mySUNI.xlsx',sheet_name=None, engine='openpyxl')
# # # 대박!!
# df.keys() # dict에 있는 함수
# df_07 = df['2020년 07월']
# df_07
# df_07.to_excel('2020년 07월 서울 브랜드별 평균 휘발유 가격.xlsx', index=False)


#자 초기에 df로 정해 놔야 니중에 편하게 약어로 쓸수 있다.!!!! 아즈아!!

In [ ]:
#df.info() 이걸 통해서 기본적인 상황을 모두 나열해 준다.111